app/views/comments/_comment.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	- if comment.user.user_pic
		-if comment.user.user_pic.include? ".png" or comment.user.user_pic.include? ".jpg" or comment.user.user_pic.include? ".gif"