app/views/users/index.html.erb

<% @users.each do |user| %>
    <% if user.user_pic and (user.user_pic.include? ".png" or user.user_pic.include? ".jpg" or user.user_pic.include? ".gif") %>
---
SELECT "users".* FROM "users"


                                    <% if user.posts.size>0 %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1

- if comment.user.user_pic
        -if comment.user.user_pic.include? ".png" or comment.user.user_pic.include? ".jpg" or comment.user.user_pic.include? ".gif"
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1