app/views/users/show.html.erb

                                    <% end %>
                                    <% if @user.posts.size>0 %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1