app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
---
<div align="left">Категория:
  <%= f.select :category_id, Category.all.collect {|x| [x.title, x.id]}, {}%>