app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @posts = @category.posts.order('created_at DESC').paginate(:page => params[:page], :per_page => 6)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = 1 ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "slug", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 24 Nov 2013 21:12:22 UTC +00:00], ["slug", "novaya"], ["title", "новая"], ["updated_at", Sun, 24 Nov 2013 21:12:22 UTC +00:00]]

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "categories" SET "slug" = 'rails', "updated_at" = '2013-11-23 19:26:48.784788' WHERE "categories"."id" = 1

  def destroy
    @category = Category.find(params[:id])

    @category.posts.each do |post|
      post.update_attribute(:category_id, -1)
    end


    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]