app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "lft", "parent_id", "rgt", "subject", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
      def create
        I18n.locale = :ru
        @comment_hash = params[:comment]
        @obj = @comment_hash[:commentable_type].constantize.find(@comment_hash[:commentable_id])
        # Not implemented: check to see whether the user has permission to create a comment on this object
        @comment = Comment.build_from(@obj, current_user.id, @comment_hash[:body])
        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
      def destroy
        @comment = Comment.find(params[:id])
        if @comment.destroy