app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
	@title = "Все записи"
    @posts = Post.paginate(:page => params[:page], :per_page => 6).order('created_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры ваплвопрдлпры апры вап<br>лвопрдлпры апры вап<br><br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры ваплвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры вап<br>лвопрдлпры апры ваплвопрдлпры апры вап<br>лвопрдлпры апры вап<br><br>', "slug" = 'vat', "updated_at" = '2013-11-24 18:32:29.117112' WHERE "posts"."id" = 5
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])