app/controllers/registrations_controller.rb

UPDATE "users" SET "user_pic" = '/assets/de_vano_avatar.jpg', "updated_at" = '2013-11-24 21:29:39.842501' WHERE "users"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
---
  def update
    # For Rails 4
#    account_update_params = devise_parameter_sanitizer.sanitize(:account_update)
    # For Rails 3
     account_update_params = params[:user]

    # required for settings form to submit when password is left blank
    if account_update_params[:password].blank?
      account_update_params.delete("password")
      account_update_params.delete("password_confirmation")
      account_update_params.delete("current_password")
    end

    @user = User.find(current_user.id)



    if @user.update_attributes(account_update_params)

        @user.posts.each do |p|